package Comments_29;


/* Комментарии к методам:
    1. @param описание переменной
    Добавляет в описание метода раздел параметров.
    Раздел параметров можно развернуть на несколько строк.
    Кроме того, можно использовать элементы HTML-разметки.
    Все дескрипторы брагат, относящиеся к одному методу,
    должны быть сгруппированы вместе.

    2. @return описание
    Добавляет в описание метода раздел возвращаемого значения.
    Этот раздел также может занимать несколько строк и допускает
    форматирование с помощью дескрипторов HTML-разметки.

    3. @throws описание класса
    Указывает на то, что метод способен генерировать исключение.

Комментарии общего характера:
    В комментариях к классам можно использовать следующие дескрипторы:
    1. @author имя
    Создает раздел автора программы. В комментариях может быть
    несколько таких дескрипторов — по одному на каждого автора.

    2. @aversion текст
    Создает раздел версии программы. В данном случае текст означает
    произвольное описание текущей версии программы.
    При написании любых комментариев, предназначенных для составления
    документации, можно также использовать следующие дескрипторы.

    3. @since текст
    Создает раздел начальной точки отсчета. Здесь текст означает
    описание версии программы, в которой впервые был внедрен данный
    компонент. Например, @since version 1.7.1.

    4. @deprecated текст
    Добавляет сообщение о том, что класс, метод или переменная не рекомендуется
    к применению. Подразумевается, что после дескриптора @deprecated
    следует некоторое выражение.

    5. @see и @ link. С помощью данных дескрипторов можно указывать гипертекстовые ссылки
    на соответствующие внешние документы или на отдельную часть того же документа,
    сформированного с помощью утилиты javadoc.

*/

public class Comments {
}
