package creatingObject_22;


/*
1. Состояние - это информация, которой объект владеет.
Переменные экземпляра характеризуют состояние объекта.

2. Поведение объекта определяется методами, которые можно вызвать.
Каждый объект сохраняет информацию о своем состоянии. Со временем
состояние объекта может измениться, но спонтанно это произойти не может.
Состояние объекта можеттизменяться только в результате вызовов методов.
(Если состояние объекта изменилось вследствие иных причин, значит,
принцип инкапсуляции не соблюден.)

3. Идентичность – это такое свойство объекта, которое отличает его от
всех других объектов.
*/

public class ObjectProperties {


}
