package methods_2;


/* Статическое связывание - это процесс вызова компилятором методов,
которые объявлены с ключевыми словами private, static, final или
конструкторов

Динамическое связывание - это процесс вызова метода по неявному параметру
во время выполнения программы.
Динамическое связывание обладает одной важной особенностью: оно позволяет
видоизменять программы без перекомпиляции их исходного кода. Это делает
программы динамически расширяемыми.

*/


public class DynamicStaticBinding {
}
