package dataStructures_20;

/* —в€зный список Ч это упор€доченна€ коллекци€, в которой имеет значение расположение объектов.
¬ €зыке программировани€ Java все св€зные списки на самом деле €вл€ютс€ двунаправленными, т.е. в каждой св€зке хранитс€ ссылка на ее предшественника
(рис. 9.7). ”даление элемента из середины св€зного списка Ч недорога€ операци€
с точки зрени€ потребл€емых вычислительных ресурсов, поскольку в этом случае достаточно обновить лишь св€зки, соседние с удал€емым элементом.
»нтерфейс ListMy описывает упор€доченную коллекцию, в которой имеет значение расположение элемента.




*/
public class LinkedListMy {
}
